PIPE/STRATEGY_I/CASE/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          144;
        startFace       293744;
    }
    outlet
    {
        type            patch;
        nFaces          144;
        startFace       293888;
    }
    pipe
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1024;
        startFace       294032;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          147456;
        startFace       295056;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          147456;
        startFace       442512;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       589968;
    }
)

// ************************************************************************* //
